'''
Степень двойки

Примеры:

Тест 1
Входные данные:
2
Вывод программы:
4
'''

num = input()
num = int(num)

step = input()
step = int(step)

print(num**step)
input()