'''
Степень двойки

Примеры:

Тест 1
Входные данные:
2
Вывод программы:
4
'''

num = 2


step = input()
step = int(step)

print(num**step)
input()