'''
Степень двойки

Примеры:

Тест 1
Входные данные:
2
Вывод программы:
4
'''

a = int(input('Введите любое число: '))
b = a ** 2
print(b)
input()