'''
Степень двойки

Примеры:

Тест 1
Входные данные:
2
Вывод программы:
4
'''
num = int(input())
print(2**num)
input()