'''
Степень двойки

Примеры:

Тест 1
Входные данные:
2
Вывод программы:
4
'''
n = 2
print(2**n)