'''
Степень двойки

Примеры:

Тест 1
Входные данные:
2
Вывод программы:
4
'''
print('введите число')
num = input()
num = int(num)

print('в какую степень будет введенно число')
step = input()
step = int(step)

print('ответ')
print(num**step)
input()