'''
Степень двойки

Примеры:

Тест 1
Входные данные:
2
Вывод программы:
4
'''
print('введите число')