'''
Степень двойки

Примеры:

Тест 1
Входные данные:
2
Вывод программы:
4
'''
N = int(input("школьников: "))
K = int(input("яблок: "))
n = 2
print(2**n)