'''
Вводится единственное целое неотрицательное число.
Получить последнюю цифру

Примеры:

Тест 1
Входные данные:
179

Вывод программы:
9
'''

a = input()
a = int(a)
print(a % 10)
input()