'''
Вводится единственное целое неотрицательное число.
Получить последнюю цифру

Примеры:

Тест 1
Входные данные:
179

Вывод программы:
9
'''

num = int(input())
x = num % 10
print(x)
