'''
Дано положительное двузначное число. 
Найдите число десятков в нем.

Примеры:

Тест 1
Входные данные:
42

Вывод программы:
4
'''

num = int(input())
x = num // 10
print(x)