'''
Дано положительное двузначное число. 
Найдите число десятков в нем.

Примеры:

Тест 1
Входные данные:
42

Вывод программы:
4
'''

a = input('Введите число: ')
b = int(a)//10
print(b)
input()