'''
Дано положительное двузначное число. 
Найдите число десятков в нем.

Примеры:

Тест 1
Входные данные:
42

Вывод программы:
4
'''

a = input()
a = int(a)

print(a // 10)
input()